MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB210/mcu.h
#define _U1CNFG2_UVBUSDIS_POSITION               0x00000002
#define _U1CNFG2_UVBUSDIS_MASK                   0x00000004
#define _U1CNFG2_UVBUSDIS_LENGTH                 0x00000001

#define _U1CNFG2_EXTI2CEN_POSITION               0x00000003
#define _U1CNFG2_EXTI2CEN_MASK                   0x00000008
#define _U1CNFG2_EXTI2CEN_LENGTH                 0x00000001

#define _U1CNFG2_PUVBUS_POSITION                 0x00000004
#define _U1CNFG2_PUVBUS_MASK                     0x00000010
#define _U1CNFG2_PUVBUS_LENGTH                   0x00000001

#define _U1CNFG2_UVCMPSEL_POSITION               0x00000005
#define _U1CNFG2_UVCMPSEL_MASK                   0x00000020
#define _U1CNFG2_UVCMPSEL_LENGTH                 0x00000001

#define _U1EP0_EPHSHK_POSITION                   0x00000000
#define _U1EP0_EPHSHK_MASK                       0x00000001
#define _U1EP0_EPHSHK_LENGTH                     0x00000001

#define _U1EP0_EPSTALL_POSITION                  0x00000001
#define _U1EP0_EPSTALL_MASK                      0x00000002
#define _U1EP0_EPSTALL_LENGTH                    0x00000001

#define _U1EP0_EPTXEN_POSITION                   0x00000002
#define _U1EP0_EPTXEN_MASK                       0x00000004
#define _U1EP0_EPTXEN_LENGTH                     0x00000001

#define _U1EP0_EPRXEN_POSITION                   0x00000003
#define _U1EP0_EPRXEN_MASK                       0x00000008
#define _U1EP0_EPRXEN_LENGTH                     0x00000001

#define _U1EP0_EPCONDIS_POSITION                 0x00000004
#define _U1EP0_EPCONDIS_MASK                     0x00000010
#define _U1EP0_EPCONDIS_LENGTH                   0x00000001

#define _U1EP0_RETRYDIS_POSITION                 0x00000006
#define _U1EP0_RETRYDIS_MASK                     0x00000040
#define _U1EP0_RETRYDIS_LENGTH                   0x00000001

#define _U1EP0_LSPD_POSITION                     0x00000007
#define _U1EP0_LSPD_MASK                         0x00000080
#define _U1EP0_LSPD_LENGTH                       0x00000001

#define _U1EP0_EPINEN_POSITION                   0x00000002
#define _U1EP0_EPINEN_MASK                       0x00000004
#define _U1EP0_EPINEN_LENGTH                     0x00000001

#define _U1EP0_EPOUTEN_POSITION                  0x00000003
#define _U1EP0_EPOUTEN_MASK                      0x00000008
#define _U1EP0_EPOUTEN_LENGTH                    0x00000001

#define _U1EP0_LOWSPD_POSITION                   0x00000007
#define _U1EP0_LOWSPD_MASK                       0x00000080
#define _U1EP0_LOWSPD_LENGTH                     0x00000001

#define _U1EP1_EPHSHK_POSITION                   0x00000000
#define _U1EP1_EPHSHK_MASK                       0x00000001
#define _U1EP1_EPHSHK_LENGTH                     0x00000001

#define _U1EP1_EPSTALL_POSITION                  0x00000001
#define _U1EP1_EPSTALL_MASK                      0x00000002
#define _U1EP1_EPSTALL_LENGTH                    0x00000001

#define _U1EP1_EPTXEN_POSITION                   0x00000002
#define _U1EP1_EPTXEN_MASK                       0x00000004
#define _U1EP1_EPTXEN_LENGTH                     0x00000001

#define _U1EP1_EPRXEN_POSITION                   0x00000003
#define _U1EP1_EPRXEN_MASK                       0x00000008
#define _U1EP1_EPRXEN_LENGTH                     0x00000001

#define _U1EP1_EPCONDIS_POSITION                 0x00000004
#define _U1EP1_EPCONDIS_MASK                     0x00000010
#define _U1EP1_EPCONDIS_LENGTH                   0x00000001

#define _U1EP1_EPINEN_POSITION                   0x00000002
#define _U1EP1_EPINEN_MASK                       0x00000004
#define _U1EP1_EPINEN_LENGTH                     0x00000001

#define _U1EP1_EPOUTEN_POSITION                  0x00000003
#define _U1EP1_EPOUTEN_MASK                      0x00000008
#define _U1EP1_EPOUTEN_LENGTH                    0x00000001

#define _U1EP2_EPHSHK_POSITION                   0x00000000
#define _U1EP2_EPHSHK_MASK                       0x00000001
#define _U1EP2_EPHSHK_LENGTH                     0x00000001

#define _U1EP2_EPSTALL_POSITION                  0x00000001
#define _U1EP2_EPSTALL_MASK                      0x00000002
#define _U1EP2_EPSTALL_LENGTH                    0x00000001

#define _U1EP2_EPTXEN_POSITION                   0x00000002
#define _U1EP2_EPTXEN_MASK                       0x00000004
#define _U1EP2_EPTXEN_LENGTH                     0x00000001

#define _U1EP2_EPRXEN_POSITION                   0x00000003
#define _U1EP2_EPRXEN_MASK                       0x00000008
#define _U1EP2_EPRXEN_LENGTH                     0x00000001

#define _U1EP2_EPCONDIS_POSITION                 0x00000004
#define _U1EP2_EPCONDIS_MASK                     0x00000010
#define _U1EP2_EPCONDIS_LENGTH                   0x00000001

#define _U1EP2_EPINEN_POSITION                   0x00000002
#define _U1EP2_EPINEN_MASK                       0x00000004
#define _U1EP2_EPINEN_LENGTH                     0x00000001

#define _U1EP2_EPOUTEN_POSITION                  0x00000003
#define _U1EP2_EPOUTEN_MASK                      0x00000008
#define _U1EP2_EPOUTEN_LENGTH                    0x00000001

#define _U1EP3_EPHSHK_POSITION                   0x00000000
#define _U1EP3_EPHSHK_MASK                       0x00000001
#define _U1EP3_EPHSHK_LENGTH                     0x00000001

#define _U1EP3_EPSTALL_POSITION                  0x00000001
#define _U1EP3_EPSTALL_MASK                      0x00000002
#define _U1EP3_EPSTALL_LENGTH                    0x00000001

#define _U1EP3_EPTXEN_POSITION                   0x00000002
#define _U1EP3_EPTXEN_MASK                       0x00000004
#define _U1EP3_EPTXEN_LENGTH                     0x00000001

#define _U1EP3_EPRXEN_POSITION                   0x00000003
#define _U1EP3_EPRXEN_MASK                       0x00000008
#define _U1EP3_EPRXEN_LENGTH                     0x00000001

#define _U1EP3_EPCONDIS_POSITION                 0x00000004
#define _U1EP3_EPCONDIS_MASK                     0x00000010
#define _U1EP3_EPCONDIS_LENGTH                   0x00000001

#define _U1EP3_EPINEN_POSITION                   0x00000002
#define _U1EP3_EPINEN_MASK                       0x00000004
#define _U1EP3_EPINEN_LENGTH                     0x00000001

#define _U1EP3_EPOUTEN_POSITION                  0x00000003
#define _U1EP3_EPOUTEN_MASK                      0x00000008
#define _U1EP3_EPOUTEN_LENGTH                    0x00000001

#define _U1EP4_EPHSHK_POSITION                   0x00000000
#define _U1EP4_EPHSHK_MASK                       0x00000001
#define _U1EP4_EPHSHK_LENGTH                     0x00000001

#define _U1EP4_EPSTALL_POSITION                  0x00000001
#define _U1EP4_EPSTALL_MASK                      0x00000002
#define _U1EP4_EPSTALL_LENGTH                    0x00000001

#define _U1EP4_EPTXEN_POSITION                   0x00000002
#define _U1EP4_EPTXEN_MASK                       0x00000004
#define _U1EP4_EPTXEN_LENGTH                     0x00000001

#define _U1EP4_EPRXEN_POSITION                   0x00000003
#define _U1EP4_EPRXEN_MASK                       0x00000008
#define _U1EP4_EPRXEN_LENGTH                     0x00000001

#define _U1EP4_EPCONDIS_POSITION                 0x00000004
#define _U1EP4_EPCONDIS_MASK                     0x00000010
#define _U1EP4_EPCONDIS_LENGTH                   0x00000001

#define _U1EP4_EPINEN_POSITION                   0x00000002
#define _U1EP4_EPINEN_MASK                       0x00000004
#define _U1EP4_EPINEN_LENGTH                     0x00000001

#define _U1EP4_EPOUTEN_POSITION                  0x00000003
#define _U1EP4_EPOUTEN_MASK                      0x00000008
#define _U1EP4_EPOUTEN_LENGTH                    0x00000001

#define _U1EP5_EPHSHK_POSITION                   0x00000000
#define _U1EP5_EPHSHK_MASK                       0x00000001
#define _U1EP5_EPHSHK_LENGTH                     0x00000001

#define _U1EP5_EPSTALL_POSITION                  0x00000001
#define _U1EP5_EPSTALL_MASK                      0x00000002
#define _U1EP5_EPSTALL_LENGTH                    0x00000001

#define _U1EP5_EPTXEN_POSITION                   0x00000002
#define _U1EP5_EPTXEN_MASK                       0x00000004
#define _U1EP5_EPTXEN_LENGTH                     0x00000001

#define _U1EP5_EPRXEN_POSITION                   0x00000003
#define _U1EP5_EPRXEN_MASK                       0x00000008
#define _U1EP5_EPRXEN_LENGTH                     0x00000001

#define _U1EP5_EPCONDIS_POSITION                 0x00000004
#define _U1EP5_EPCONDIS_MASK                     0x00000010
#define _U1EP5_EPCONDIS_LENGTH                   0x00000001

