MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB210/mcu.h
#define _PMCS2BS_BASE18_POSITION                 0x0000000A
#define _PMCS2BS_BASE18_MASK                     0x00000400
#define _PMCS2BS_BASE18_LENGTH                   0x00000001

#define _PMCS2BS_BASE19_POSITION                 0x0000000B
#define _PMCS2BS_BASE19_MASK                     0x00000800
#define _PMCS2BS_BASE19_LENGTH                   0x00000001

#define _PMCS2BS_BASE20_POSITION                 0x0000000C
#define _PMCS2BS_BASE20_MASK                     0x00001000
#define _PMCS2BS_BASE20_LENGTH                   0x00000001

#define _PMCS2BS_BASE21_POSITION                 0x0000000D
#define _PMCS2BS_BASE21_MASK                     0x00002000
#define _PMCS2BS_BASE21_LENGTH                   0x00000001

#define _PMCS2BS_BASE22_POSITION                 0x0000000E
#define _PMCS2BS_BASE22_MASK                     0x00004000
#define _PMCS2BS_BASE22_LENGTH                   0x00000001

#define _PMCS2BS_BASE23_POSITION                 0x0000000F
#define _PMCS2BS_BASE23_MASK                     0x00008000
#define _PMCS2BS_BASE23_LENGTH                   0x00000001

#define _PMCS2MD_DWAITE_POSITION                 0x00000000
#define _PMCS2MD_DWAITE_MASK                     0x00000003
#define _PMCS2MD_DWAITE_LENGTH                   0x00000002

#define _PMCS2MD_DWAITM_POSITION                 0x00000002
#define _PMCS2MD_DWAITM_MASK                     0x0000003C
#define _PMCS2MD_DWAITM_LENGTH                   0x00000004

#define _PMCS2MD_DWAITB_POSITION                 0x00000006
#define _PMCS2MD_DWAITB_MASK                     0x000000C0
#define _PMCS2MD_DWAITB_LENGTH                   0x00000002

#define _PMCS2MD_ACKM_POSITION                   0x0000000E
#define _PMCS2MD_ACKM_MASK                       0x0000C000
#define _PMCS2MD_ACKM_LENGTH                     0x00000002

#define _PMCS2MD_DWAITE0_POSITION                0x00000000
#define _PMCS2MD_DWAITE0_MASK                    0x00000001
#define _PMCS2MD_DWAITE0_LENGTH                  0x00000001

#define _PMCS2MD_DWAITE1_POSITION                0x00000001
#define _PMCS2MD_DWAITE1_MASK                    0x00000002
#define _PMCS2MD_DWAITE1_LENGTH                  0x00000001

#define _PMCS2MD_DWAITM0_POSITION                0x00000002
#define _PMCS2MD_DWAITM0_MASK                    0x00000004
#define _PMCS2MD_DWAITM0_LENGTH                  0x00000001

#define _PMCS2MD_DWAITM1_POSITION                0x00000003
#define _PMCS2MD_DWAITM1_MASK                    0x00000008
#define _PMCS2MD_DWAITM1_LENGTH                  0x00000001

#define _PMCS2MD_DWAITM2_POSITION                0x00000004
#define _PMCS2MD_DWAITM2_MASK                    0x00000010
#define _PMCS2MD_DWAITM2_LENGTH                  0x00000001

#define _PMCS2MD_DWAITM3_POSITION                0x00000005
#define _PMCS2MD_DWAITM3_MASK                    0x00000020
#define _PMCS2MD_DWAITM3_LENGTH                  0x00000001

#define _PMCS2MD_DWAITB0_POSITION                0x00000006
#define _PMCS2MD_DWAITB0_MASK                    0x00000040
#define _PMCS2MD_DWAITB0_LENGTH                  0x00000001

#define _PMCS2MD_DWAITB1_POSITION                0x00000007
#define _PMCS2MD_DWAITB1_MASK                    0x00000080
#define _PMCS2MD_DWAITB1_LENGTH                  0x00000001

#define _PMCS2MD_ACKM0_POSITION                  0x0000000E
#define _PMCS2MD_ACKM0_MASK                      0x00004000
#define _PMCS2MD_ACKM0_LENGTH                    0x00000001

#define _PMCS2MD_ACKM1_POSITION                  0x0000000F
#define _PMCS2MD_ACKM1_MASK                      0x00008000
#define _PMCS2MD_ACKM1_LENGTH                    0x00000001

#define _PMSTAT_OB0E_POSITION                    0x00000000
#define _PMSTAT_OB0E_MASK                        0x00000001
#define _PMSTAT_OB0E_LENGTH                      0x00000001

#define _PMSTAT_OB1E_POSITION                    0x00000001
#define _PMSTAT_OB1E_MASK                        0x00000002
#define _PMSTAT_OB1E_LENGTH                      0x00000001

#define _PMSTAT_OB2E_POSITION                    0x00000002
#define _PMSTAT_OB2E_MASK                        0x00000004
#define _PMSTAT_OB2E_LENGTH                      0x00000001

#define _PMSTAT_OB3E_POSITION                    0x00000003
#define _PMSTAT_OB3E_MASK                        0x00000008
#define _PMSTAT_OB3E_LENGTH                      0x00000001

#define _PMSTAT_OBUF_POSITION                    0x00000006
#define _PMSTAT_OBUF_MASK                        0x00000040
#define _PMSTAT_OBUF_LENGTH                      0x00000001

#define _PMSTAT_OBE_POSITION                     0x00000007
#define _PMSTAT_OBE_MASK                         0x00000080
#define _PMSTAT_OBE_LENGTH                       0x00000001

#define _PMSTAT_IB0F_POSITION                    0x00000008
#define _PMSTAT_IB0F_MASK                        0x00000100
#define _PMSTAT_IB0F_LENGTH                      0x00000001

#define _PMSTAT_IB1F_POSITION                    0x00000009
#define _PMSTAT_IB1F_MASK                        0x00000200
#define _PMSTAT_IB1F_LENGTH                      0x00000001

#define _PMSTAT_IB2F_POSITION                    0x0000000A
#define _PMSTAT_IB2F_MASK                        0x00000400
#define _PMSTAT_IB2F_LENGTH                      0x00000001

#define _PMSTAT_IB3F_POSITION                    0x0000000B
#define _PMSTAT_IB3F_MASK                        0x00000800
#define _PMSTAT_IB3F_LENGTH                      0x00000001

#define _PMSTAT_IBOV_POSITION                    0x0000000E
#define _PMSTAT_IBOV_MASK                        0x00004000
#define _PMSTAT_IBOV_LENGTH                      0x00000001

#define _PMSTAT_IBF_POSITION                     0x0000000F
#define _PMSTAT_IBF_MASK                         0x00008000
#define _PMSTAT_IBF_LENGTH                       0x00000001

#define _ALCFGRPT_ARPT_POSITION                  0x00000000
#define _ALCFGRPT_ARPT_MASK                      0x000000FF
#define _ALCFGRPT_ARPT_LENGTH                    0x00000008

#define _ALCFGRPT_ALRMPTR_POSITION               0x00000008
#define _ALCFGRPT_ALRMPTR_MASK                   0x00000300
#define _ALCFGRPT_ALRMPTR_LENGTH                 0x00000002

#define _ALCFGRPT_AMASK_POSITION                 0x0000000A
#define _ALCFGRPT_AMASK_MASK                     0x00003C00
#define _ALCFGRPT_AMASK_LENGTH                   0x00000004

#define _ALCFGRPT_CHIME_POSITION                 0x0000000E
#define _ALCFGRPT_CHIME_MASK                     0x00004000
#define _ALCFGRPT_CHIME_LENGTH                   0x00000001

#define _ALCFGRPT_ALRMEN_POSITION                0x0000000F
#define _ALCFGRPT_ALRMEN_MASK                    0x00008000
#define _ALCFGRPT_ALRMEN_LENGTH                  0x00000001

